

import { unstable_batchedUpdates, flushSync } from 'react-dom';
// Батчинг - процесс группировки нескольких обновлений состояния в один рендер.
// Иными словами Пакетная обработка.
// В 18-ой версии автоматически отрабатывается, реагируя на асинхронные куски кода

// Для 17-ой версии можно играть через
unstable_batchedUpdates(() => { /* Группа из:setState(..) */ })
flushSync(() => { }) /* Позволяет вам синхронно реагировать 
на любые обновления внутри callbacks. При этом произойдет немедленный рендер
Можно эту фичу считать принудительным батчингом с костылем. */
