// CSS Layers -  Каскадные слои. Позволяет определять дополнительно слои CSS файлов в уже
// существующий проект для управления CSS свойствами.
// То есть это - РЕШЕНИЕ ПРОБЛЕМЫ КОНФЛИКТОВ СПЕЦИФИЧНОСТИ CSS СЕЛЕКТОРОВ.
// другие решения, не best practice: 1. Адресный селектор отдельно для объекта, 2. !important,
// ...3. inline styles in js

// https://developer.mozilla.org/en-US/docs/Learn/CSS/Building_blocks/Cascade_layers

// Специфичность - это способ, с помощью которого браузеры определяют,
// какие значения свойств CSS наиболее соответствуют элементу и,
// следовательно, будут применены.
// Специфичность представляет собой вес, придаваемый конкретному правилу CSS.