// CSS Layers -  Каскадные слои. Позволяет определять дополнительно слои CSS файлов в уже
// существующий проект для управления CSS свойствами.
// То есть это - РЕШЕНИЕ ПРОБЛЕМЫ КОНФЛИКТОВ СПЕЦИФИЧНОСТИ CSS СЕЛЕКТОРОВ.
// другие решения, не best practice: 1. Адресный селектор отдельно для объекта, 2. !important,
// ... 3. inline styles in js

// https://developer.mozilla.org/en-US/docs/Learn/CSS/Building_blocks/Cascade_layers

// CSS Layer - пример выполнения в коде
import './css-layer.css'

// Специфичность - это способ, с помощью которого браузеры определяют,
// какие значения свойств CSS наиболее соответствуют элементу и,
// следовательно, будут применены.
// Специфичность представляет собой вес, придаваемый конкретному правилу CSS.



//         МАТЕМАТИКА КАСКАДА СТИЛЕЙ    или определение специфичности
//   1. браузерные стили (user agent stylesheet)
//   2. пользовательские стили от браузера (extentions или расширения браузера, пример ADBLOCK)
//   3. наши стили приложения
// 	  3.1 inline-style in HTML
//  	  3.2 CSS Layers(выше объяснение)
// 	  3.3 Специфичность селекторов CSS (дальше - больше -> first-line[pseudoElements], div[tag], first-child[pseudoClasses], attr, class, id, style in HTML)
// 	  3.4 Порядок следования в коде (чем ниже, тем сильнее)
